app/Http/Controllers/User/Auth/UserController.php

select * from `users` limit 10 offset 0
select count(*) as aggregate from `users`
---
    public function index()
    {
        $users = User::paginate(10);

select * from `users` where `users`.`id` = 5 limit 1
---
    public function show($user)
    {
        $user = User::find(decrypt($user));

select * from `users` where `users`.`id` = '3' limit 1
delete from `users` where `id` = 3
select * from `users` where `users`.`id` in (16, 0, 0, 0, 1, 0, 0, 2025, 2025, 2025)
---
    public function destroy($id)
    {
        $user = User::findOrFail($id);
        $user->delete();
        return redirect()->route('user.index')->with('success', 'User deleted successfully.');