app/Http/Controllers/AuthController.php

select * from `countries`
---
    public function register()
    {
        /*  return view('auth.register'); */
        $countries = Country::all();